Revit 2015 API
SpatialElementBoundarySubface Properties
The SpatialElementBoundarySubface type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SpatialBoundaryElement
 Element that gave rise to this room face.
SubfaceArisesFromElementFace
 Indicates if the subface is coincident with a portion of a (possibly offset) face of the element.
SubfaceType
 Type of the subface.
See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace